{"status": {"elapsed": 8, "timestamp": "2021-03-07T19:23:47.996515346Z"}, "data": {"id": "83e4940c-70ba-4a6e-856b-686b6f9c487e", "symbol": "XEM", "name": "NEM", "slug": "new-economy-movement", "_internal_temp_agora_id": "7868af55-e811-4032-83b1-1a03e7fa80a1", "is_verified": false, "tagline": "A performance-focused smart contracts platform ", "overview": "NEM is a smart contracts platform focused on high performance and enterprise solutions. ", "background": "NEM is a combined open-source blockchain protocol with a companion private, permissioned ledger that focuses on producing a more efficient, performance-focused competitor to completely public, open-source blockchains like Bitcoin and Ethereum. NEM aims to service enterprise blockchain markets and extreme versatility in servicing diverse markets (e.g. healthcare, government, financial markets). ", "technology": "NEM is a blockchain protocol written in Java and JavaScript that claims to run 100% original code. Instead of using common consensus algorithms like Proof of Work (PoW) or Proof of Stake (PoS), the NEM network uses Proof of Importance (PoI), which attempts to remove certain characteristics of PoW and PoS that NEM dislikes. PoI uses a time- and stake-based network incentive that sets a threshold of coins necessary to begin \"harvesting\" new coins and requires continued investment of new coins to maintain the new-coin minting privilege. \n\nNEM calls the first block the “nemesis” block, and each block can process up to 120 transactions. NEM’s blockchain exposes its functionality through an API that can interface with any programming language instead of a specific “smart contract” language. \n\nA network of \"supernodes\" maintain the NEM blockchain and new tokens (XEM) are \"harvested\" instead of mined in a typical proof-of-work (PoW) way. XEM tokens circulate through the network like other blockchain-native tokens. NEM's permissioned network companion Mijin is a private ledger that can process 4000 transactions per second and fully integrate with the main NEM chain, which NEM hopes will attract enterprise blockchain markets to NEM. ", "category": "Infrastructure", "sector": "Smart Contract Platforms", "tag": null, "sfarScore": null, "token_distribution": {"sale_start": null, "sale_end": null, "initial_distribution": 8999999999, "current_supply": null, "max_supply": 8999999999, "description": "The entirety of the NEM supply (8,999,999,999 XEM) was created in the genesis block and distributed as follows:\n53% was allocated to stakeholders\n21% was allocated to the Development fund which was set up to allow the development team to best advance the NEM blockchain, its features, and adoption. \n26% was allocated to the Sustainability fund. It is stated that the Sustainability Fund is reserved for the development of the NEM platform and community only and should not benefit anyone on the core team personally."}, "token_details": {"usage": "Payments", "type": "Native", "sales_rounds": null, "block_reward": null, "targeted_block_time_in_sec": 60, "on_chain_governance_structure": "Third-party Protocol", "is_treasury_decentralized": false, "launch_style": "Crowdsale", "initial_supply": 8999999999, "percentage_allocated_to_investors_from_initial_supply": 52.78, "percentage_allocated_to_premined_or_airdrops_from_initial_supply": 2.35, "percentage_allocated_to_organizations_or_founders_supply": 44.87, "mining_algorithm": "n/a", "next_halving_date": null, "genesis_block_date": "2015-03-29", "is_victim_of_51_percent_attack": false, "emission_type_general": "Fixed Supply", "emission_type_precise": "Premined Rewards", "is_capped_supply": true, "max_supply": 8999999999}, "organizations": null, "people": {"founding_team": null, "contributors": null, "investors": null, "advisors": null}, "relevant_resources": [{"name": "Website", "url": "https://nem.io/"}, {"name": "Github", "url": "https://github.com/NemProject"}, {"name": "Twitter", "url": "https://twitter.com/NEMofficial"}, {"name": "Telegram", "url": "https://t.me/nemred"}, {"name": "Whitepaper", "url": "https://nem.io/wp-content/themes/nem/files/NEM_techRef.pdf"}], "consensus_algorithm": "Other"}}